tutorials/compressible/PBNS/cpbnsPIMPLE/forwardStep/system/fvSchemes
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 1;
}

gradSchemes
{
    default         Gauss skewCorrected linear;
}

divSchemes
{
    default                           none;
    div(phi,Ek)                       Gauss skewCorrected linearBJ;
    div(phi,U)                        Gauss skewCorrected linearBJ;
    div(phiHat,p)                     Gauss skewCorrected linearBJ;
    div(phi,h)                        Gauss skewCorrected linearBJ;
    div((muEff*dev2(T(grad(U)))))     Gauss skewCorrected linear;
    div(((muEff*grad(U))&U))          Gauss skewCorrected linear;
    div(((muEff*dev2(T(grad(U))))&U)) Gauss skewCorrected linear;
}

laplacianSchemes
{
    default         Gauss skewCorrected linear corrected;
}

interpolationSchemes
{
    default           skewCorrected linear;
    reconstructField  linearBJ;
}

snGradSchemes
{
    default           skewCorrected corrected;
}


// ************************************************************************* //
